app/Http/Controllers/Api/auth/AuthControllerApi.php

    public function login_api(){
        $data = Validator::make(request()->all(),[
            'email'=>'required',
            'password'=>'required',
        ]);

        if(sizeof($data->errors()) == 0) {

            $credential = request()->only(['email', 'password']);
            $token = auth('api')->attempt($credential);
            if(!$token){
                //return response()->json(trans('errors.unauthenticated'),401);
                return messages::error_output(trans('errors.unauthenticated'));
            }else {
                $user = auth('api')->user();
                $user['token'] =  $token;
                $user['role'] = roles::query()->find($user->role_id);
---
select * from `roles` where `roles`.`id` = 1 and `roles`.`deleted_at` is null limit 1

    public function user(){
        $user = auth()->user();
        $user['role'] = roles::query()->find($user->role_id);
---
select * from `roles` where `roles`.`id` = 1 and `roles`.`deleted_at` is null limit 1