<?php
return [
    // ---------------------start email messages -------------------
    'activation_email_code'=>'تفعيل البريد الالكتروني الخاص بموقع sync',
    'activation_email_code_body_message'=>'لقد تمت عملية التسجيل بنجاح من فضلك قم بتفعيل الحساب الخاص بكم من خلال الضغط علي هذا الرابط ',
    // ---------------------end email messages -------------------

    // ----------------------start user table inputs ---------------------
    'username'=>'اسم المستخدم',
    'email'=>'البريد الالكتروني',
    'password'=>'كلمة السر',
    'city_id'=>'المدينة',
    'phone'=>'رقم الهاتف',
    'image'=>'الصورة',
    // ----------------------end user table inputs ---------------------


    // ----------------------start of  cities - ---------------------
    'country'=>'الدولة',
    // ----------------------start en cities - ---------------------


    // ----------------------start en jobs - ---------------------
    'ar_name'=>'الاسم بالعربي',
    'en_name'=>'الاسم بالانجليزي',
    'parent_id'=>'تابع ل',
    'career_ladder'=>'السلم الوظيفي',
    'ar_description'=>'الوصف بالعربي',
    'en_description'=>'الوصف بالانجليزي',
    'contract_period'=>'فتره العقد',
    'contract_renewable'=>'هل سيجدد العقد ؟',
    'years_experience'=>'سنين الخبرة',
    'min_salary'=>'أقل سعر',
    'max_salary'=>'أكبر سعر',
    'ar_career_path'=>'المسار المهني بالعربي',
    'en_career_path'=>'المسار المهني بالانجليزي',
    'note'=>'ملاحظات',
    'sk_group_id'=>'القسم الذي تنتهمي له المهارة',
    // ----------------------end en jobs - ---------------------

    // ----------------------start of templates - ---------------------
    'reset_password_title'=>' استعاده كلمة المرور في سكلير',
    'reset_password_message'=>'يمكنك الضغط علي الرابط المرفق لانشاء كلمة سر جديدة خاصة بك',
    'click_here'=>'اضغط هنا'
    // ----------------------end of templates - ---------------------



];
