app/Http/Repositaries/JobRepobsitary.php

insert into `jobs_data` (`ar_name`, `en_name`, `parent_id`, `career_ladder`, `ar_desc`, `en_desc`, `contract_period`, `contract_renewable`, `years_experience`, `min_salary`, `max_salary`, `ar_career_path`, `en_career_path`, `user_id`, `updated_at`, `created_at`) values ('تجربه اعلان اليوم', 'question one', '55', 'يشسي', 'يشسي', 'يشسيشس', '120', '3', '3', '1000', '50000', 'المسار المهني', 'Career Path', 2, '2023-08-20 18:00:23', '2023-08-20 18:00:23')
update `jobs_data` set `career_ladder` = 'Senior', `ar_name` = 'مصمم مواقع', `en_name` = 'Front End', `ar_desc` = 'وصف مهنة مصمم المواقع', `en_desc` = 'شرح مهنة مصمم المواقع', `contract_period` = 'every year', `contract_renewable` = '1', `years_experience` = '5', `min_salary` = '1500', `max_salary` = '5000', `ar_career_path` = 'المسار المهني', `en_career_path` = 'Career Path', `jobs_data`.`updated_at` = '2023-08-20 16:04:26' where `id` = 10
---
    public function save_job($data){
        $this->job = jobs::query()->updateOrCreate([
            'id'=>array_key_exists('id',$data) ? $data['id']:null
        ],$data);