app/Http/Controllers/DashboardController.php

    public function users(){
        $data = User::query()->with('country')->orderBy('id','DESC');
        $output = app(Pipeline::class)
            ->send($data)
            ->through([
                UsernameFilter::class,
                StartDateFilter::class,
                EndDateFilter::class
            ])
            ->thenReturn()
            ->paginate(25);
---
select * from `users` where `users`.`deleted_at` is null order by `id` desc limit 25 offset 0