app/Http/Controllers/DashboardController.php

    public function users(){
        $data = User::query()->with('country')->orderBy('id','DESC');
        $output = app(Pipeline::class)
            ->send($data)
            ->through([
                UsernameFilter::class,
                StartDateFilter::class,
                EndDateFilter::class
            ])
            ->thenReturn()
            ->paginate(8);
---
select * from `users` where `users`.`deleted_at` is null order by `id` desc limit 8 offset 0
select * from `countries` where `countries`.`id` in (1)
select count(*) as aggregate from `users` where `users`.`deleted_at` is null

    public function save_skills(SkillsFormRequest $formRequest){
        $data = $formRequest->validated();
        $output = skills::query()->updateOrCreate([
            'id'=>request()->has('id') ? request('id'):null
        ],$data);
---
insert into `skills` (`ar_title`, `en_title`, `ar_desc`, `en_desc`, `sk_group_id`, `note`, `updated_at`, `created_at`) values ('3123', '31232', '3', '23', '1', '3123', '2023-08-03 00:10:31', '2023-08-03 00:10:31')