app/Http/Controllers/JobsControllerResource.php

    public function show($id)
    {
        //
        $data = jobs::query()
            ->with(['certificates','principle_contracts','parent'=>function($e){
                $e->select('id',app()->getLocale().'_name as name');
            },'abilities','competencies','knowledge','educations','work_values','interests',
                  'work_activities'
                ,'work_contexts','skills','job_skills.skill','tasks'])
            ->find($id);
---
select * from `job_principle_contracts` where `job_principle_contracts`.`job_id` in (59)
select * from `job_skills` where `job_skills`.`job_id` in (59)
select `abilities`.*, `job_abilities`.`job_id` as `pivot_job_id`, `job_abilities`.`ability_id` as `pivot_ability_id` from `abilities` inner join `job_abilities` on `abilities`.`id` = `job_abilities`.`ability_id` where `job_abilities`.`job_id` in (59) and `abilities`.`deleted_at` is null
select `certificates`.*, `job_certificates`.`job_id` as `pivot_job_id`, `job_certificates`.`certificate_id` as `pivot_certificate_id` from `certificates` inner join `job_certificates` on `certificates`.`id` = `job_certificates`.`certificate_id` where `job_certificates`.`job_id` in (59) and `certificates`.`deleted_at` is null