app/Http/Controllers/JobsControllerResource.php

    public function show($id)
    {
        //
        $data = jobs::query()
            ->with(['certificates','abilities','knowledge','educations','work_values','interests',
                  'work_activities'
                ,'work_context','job_skills.skill','tasks'])
            ->find($id);
---
select * from `job_skills` where `job_skills`.`job_id` in (55)
select `abilities`.*, `job_abilities`.`job_id` as `pivot_job_id`, `job_abilities`.`ability_id` as `pivot_ability_id` from `abilities` inner join `job_abilities` on `abilities`.`id` = `job_abilities`.`ability_id` where `job_abilities`.`job_id` in (55) and `abilities`.`deleted_at` is null
select `certificates`.*, `job_certificates`.`job_id` as `pivot_job_id`, `job_certificates`.`certificate_id` as `pivot_certificate_id` from `certificates` inner join `job_certificates` on `certificates`.`id` = `job_certificates`.`certificate_id` where `job_certificates`.`job_id` in (55) and `certificates`.`deleted_at` is null
select `educations`.*, `job_educations`.`job_id` as `pivot_job_id`, `job_educations`.`education_id` as `pivot_education_id` from `educations` inner join `job_educations` on `educations`.`id` = `job_educations`.`education_id` where `job_educations`.`job_id` in (55)