app/Http/Controllers/UsersController.php

update `users` set `username` = 'alid', `password` = '', `users`.`updated_at` = '2023-08-02 00:59:53' where `id` = 1
---
    public function save(usersFormRequest $formRequest){
        $data = $formRequest->validated();
        if(request()->filled('password')){
            $data['password'] = bcrypt(request('password'));
        }
        $output = User::query()->updateOrCreate([
            'id'=>request()->has('id') ? request('id'):null
        ],$data);